local AlameinConditions = {
__count = 23,
__indexs = {1.32},
__values = {},
__exVals = {23,'战斗不超过$回合','存活坦克血量不低于$%','无武将阵亡','使用$阵','战斗胜利','上阵穿甲型不超过$个','上阵穿甲型不低于$个','上阵防御型不超过$个','上阵防御型不低于$个','上阵高爆型不超过$个','上阵高爆型不低于$个','上阵辅助型不超过$个','上阵辅助型不低于$个','上阵Y系坦克不超过$个','上阵Y系坦克不低于$个','上阵S系坦克不超过$个','上阵S系坦克不低于$个','上阵F系坦克不超过$个','上阵F系坦克不低于$个','上阵M系坦克不超过$个','上阵M系坦克不低于$个','上阵D系坦克不超过$个','上阵D系坦克不低于$个'},
__fields = {
	'Id',
	'Conditions'
},
__defaults = {
	nil
},
__refs = {
	{1.32}
},
__refPoss = {
	nil
},
}
return AlameinConditions