local AreaConfig = {
__count = 5,
__indexs = {1.5},
__values = {101,1.9},
__exVals = {10,'无名之森','河口平原','御水之都','御水废墟','血色沼泽','国之东北，密林之处。#不知其名，战火交错。#冷寂清幽，破败荒芜。#幽林秘境，冒险伊始。','日出之地，平缓有序。#彼岸花开，白骨遍地。#游牧之群，丘陵群栖。#接壤荒漠，一望无际。','国之王城，御水至深。#青龙昂首，都城之门。#明暗水道，遇水则分。#观澜圣地，繁荣都城。','兽潮一役，城破国亡。#废墟掩映，昔日辉煌。#神兽御阵，玄机暗藏。#危机四伏，暗箭难防。','沼地交错，血色浸染。#白叶丛生，雾气弥漫。#东北极地，荆棘漫山。#沼泽尽头，寒水之潭。'},
__fields = {
	'Id',
	'Name',
	'Include',
	'Info'
},
__defaults = {
	nil,
	nil,
	nil
},
__refs = {
	{11,1.4},
	{{{1},{1.2,2,5,-3}},{{2},{3,-2.2},{2,1,2}},{{3},{8,2},{3,2}}},
	{16,1.4}
},
__refPoss = {
	nil,
	nil,
	nil
},
}
return AreaConfig