local ChallengeMissionConfig = {
__count = 60,
__indexs = {1.12,80,1.41,1896,1.3,7,2.1,4.1,4.3},
__values = {0,1.01,2,1988,1.02,97987,994,1.2,2,1,995,1.2,998,1.3,7,1.2,988,10.2,7,989,3,7,2,1.2,986,1.3,2,1,12,1,982,1,19.2,3,1,3,1.2,980,1.2,5,9,1,983,1,2,1,3,1,10,20.2,10,1,988,1.4,9,987,1.5,6,1.3,986,6,1.2,992,3.1,1000,53.2,1.7,989,-2.3,1.3,991,1.6,994,1.3,43.2,2,990,1,2,1.9},
__exVals = {121,nil,null,'击败破庙里的妖首(%s/2)#击败破庙里的妖首(%s/2)','破庙周围妖兽聚集#不惧危机一探究竟','破庙妖首','墓穴疑云','诡影废墟','五灵阵法','琳琅洞天','进入墓穴，探索墓穴','探查这座废弃的城市，寻找其中的秘密','破除五灵阵(%s/5)#破除五灵阵(%s/5)#破除五灵阵(%s/5)#破除五灵阵(%s/5)#破除五灵阵(%s/5)#击败阴阳信徒。','偏远山林渺无人烟#孤立的墓穴布满疑云#财宝还是危机，无人知晓','曾经繁华的小城一夜之间被毁#幽暗的废墟中有人影闪过#这里究竟发生了什么，前往探查','神秘的终亡教会慢慢浮出水面#昭然若揭的阴谋究竟是什么#现在所找到的这个据点#又能提供什么信息呢','三途津','幻境','序章','迷雾之森','遇难之人','宝图之谜','孤岛','解救平民','追回财物','终亡教会','清理道路','地堡','阵法外围','承诺','影子','大业','妖兽疑踪','风波又起','又见木羊','危机将至','神秘组织','浓雾之森','风见原野','荆棘流域','白叶渡','观澜港','御水之都城门楼','破旧院子','城主府大门','市街','守护阵法','阵法','内心世界','宁幽城外','劫后余生、','和受伤的冒险者交谈。#解救冒险者的朋友。#返回冒险者身边。#找到银月草和白灵花。#带给受伤的冒险者。','和村民们交谈。#探查高塔的秘密。#回去通知村民们。','向遇难者打听情况。#闯进马贼营寨。#找到逃走的马贼。#再次返回营寨。#救出小叶。#回到遇难者身边。','与附近的渔民交谈。#帮渔民找到船。#探索藏宝图标记地点。(%s/2)#探索藏宝图标记地点。(%s/2)#探索最终的藏宝点。','和商人对话。#搜集物资。(%s/4)#搜集物资。(%s/4)#搜集物资。(%s/4)#搜集物资。(%s/4)#回复商人。#神秘石像。#回复楚恒。','与守备军士兵交谈。#搜索北方和西方(%s/2)#搜索北方和西方(%s/2)#返回观澜港。#前往观澜港南方。#护送居民前往御水之都。','看看前面发生了什么。#寻找据点。#使用幻魂草击败地痞，追回财物。#继续追击(%s/2)#继续追击(%s/2)#与楚恒汇合。#打败大长老。#回复平民。','出去看看。#在城里四处走走。#去南面城墙看一看。#破坏阵眼(%s/3)#破坏阵眼(%s/3)#破坏阵眼(%s/3)#击败终亡信徒。#找出混入人群的信徒(%s/3)#找出混入人群的信徒(%s/3)#找出混入人群的信徒(%s/3)','找到护卫长。#清理妖兽。#找到灵智妖兽。#击退罩袍人(%s/3)#击退罩袍人(%s/3)#击退罩袍人(%s/3)#和护卫长对话。#找回灵石，回复护卫长。#将灵石运往法阵。','与楚恒交谈。#在地堡周围找到贾裴文。#在南方找到止血药。#治好贾裴文。#救出地堡的平民。#护送平民返回法阵。','开启阵法。#寻找刻笔。#与楚恒交谈。#搜索城南兵器库。#搜索城西兵器库。#逃出生天，返回阵法处。','四处走走。#与楚恒交谈。#消灭幻境中的幻象(%s/3)#消灭幻境中的幻象(%s/3)#消灭幻境中的幻象(%s/3)#神秘的幻灵。#破阵之道。','解决妖兽#解决其余灵智妖兽(%s/3)#解决其余灵智妖兽(%s/3)#解决其余灵智妖兽(%s/3)#返回传送阵','和影子交谈。#帮小影塑造外形。#为小影找到六欲(%s/3)#为小影找到六欲(%s/3)#为小影找到六欲(%s/3)#听听小影的讲述。','向石御霏询问情况。#调查地图南部。#调查西边的森林。#调查东边森林。#回复石御霏。','与石御霏交谈。#接取任务。#调查森林。#继续追查。#收集兽肉。（%s/2）#收集兽肉。（%s/2）#布置陷阱。（%s/2）#布置陷阱。（%s/2）#等待“妖兽”出现。#与老李交谈。','与军官交谈。#探查义庄。#前往案发现场。#搜集证据。（%s/2）#搜集证据。（%s/2）#调查酒家。#真相。#回复军官。','与韩灵儿交谈。#教训混混。（%s/3）#教训混混。（%s/3）#教训混混。（%s/3）#回去找韩灵儿。#初见白木。#大战赌坊。#追击业火堂主。#回复韩灵儿。','与韩星对话。#找到韩灵儿。#捕获野兽。（%s/2）#捕获野兽。（%s/2）#救援宁月。#汇合。#再遇妖兽。#回复韩星。','与楚恒交谈。#前往赌坊。#乔装。#搜集请帖。（%s/2）#搜集请帖。（%s/2）#潜入神秘组织（%s/2）。#潜入神秘组织（%s/2）。#伙伴来援。（%s/2）#伙伴来援。（%s/2）#抓捕密会者。（%s/3）#抓捕密会者。（%s/3）#抓捕密会者。（%s/3）#回复石御霏。','击败掩映于浓雾中的妖兽。#击败剩余的妖兽。','探查三途津。#击败剩余妖兽。','击杀风见原野的妖兽。#击杀再次出现的妖兽。#击杀最后的妖兽。','支援渔民。#支援南面渔民。#消灭最后的妖兽。','白叶渡。#妖兽据点。#杀之不尽。#肃清白叶渡。','港口遇袭。#再战妖兽。#守卫港口。','御水之都告急。#妖兽入侵。#掩护平民。#守护城门。','击败妖兽。#守护阵法。','支援城主府。#击退妖兽。#守护灵石。','妖兽来袭。#守护灵石。#绝不后退。#死战到底。','遇袭。#死战。#阵法。','初入幻境。#幻境妖兽。#破阵。','阵法禁制。#破阵而出','初入心境。#另一个自己？#再战心魔。#破阵而出','妖兽的踪迹。#不平静的森林。#再斩妖兽。','结束？不，是开始','浓雾森林危险重重#听说有冒险者被困其中#请前往帮助','原本三途津平静祥和#但是最近妖兽频出#村民受害颇深#请前往帮助','路边荒草，林中断木#兽潮侵袭之下已没有之前的安静祥和#乱世之中，无人可以幸免#逃亡路上，马贼猖獗，前往击杀','荆棘流域水道丰富，交错东流#惊鸿照影，渔舟唱晚#听说这里还有未被发掘的宝藏#前往探查','海天无际，风高浪急#逃难的船在航行中受到损害#偶遇一个孤岛，暂时修整#采集物资以做补给','观澜港外围的妖兽越聚越多，但港内仍#有许多居民还未撤进御水之都……','妖兽围城，危在旦夕#城内却有地痞趁火打劫#前往击败','妖兽临城，危在旦夕，此间之际，谣言四起#谣言的传播使城中人心惶惶#找到源头，解决谣言的散布者','妖兽已侵入城中，处处战火纷飞#不明身份的神秘人出现，欲夺取灵石#前往阻止','战争如火如荼#城中还有平民没有撤离到安全区域#前往地堡寻找#营救平民','城墙已破，妖兽已然侵入#准备启动阵法的材料#这是最后的生机','幻境乾坤，幻象丛生#是肯定还是质疑#一直以来的所作所为是否正确#总之，击破幻境','终亡教徒再次出现#引出巨大的阴谋#为了守护苍生，摧毁法阵','孙龙所说的副作用产生了#但却是如此的出乎意料#可事已至此，也只能随机应变了#探查当前环境','御水之都已经陷落#逃出御水之都的众人刚刚松了口气#却又面临了新的危机','妖兽以摧枯拉朽的势态攻下御水之都#众人拼尽全力逃到了宁幽城#但是还没来得及喘口气#新的事件已经悄然接近','本以为安全的宁幽城#却接连不断的发生怪异的事情#是否危险又再一次的接近#找出真相','神秘的木羊盟会隐藏着什么#那些疯子口中的大业又是指什么#迷雾重重环绕#兽潮之下究竟还隐藏着那些黑暗','御水之都刚刚覆灭不久#妖兽的踪迹再次出现#宁幽城就是妖兽的下一个目标#危机重重之下，该如何应对','一股神秘的力量再威胁着新兴的盟会#危机四伏，步步惊险#必须先下手为强#解除盟会危机','浓雾掩映下的森林，有妖兽出没的痕迹','三途津也遭到了妖兽的屠戮，前往探查','风见原野也出现了零散的妖兽，击杀！','荆棘流域被妖兽袭击，赶快支援渔民。','肃清白叶渡，方便前往观澜港','观澜港遇袭，火速支援','守护御水之都','守护御水之都内的阵法','支援城主府','护送灵石，启动阵法','守护阵法，击退妖兽','破除幻境','破除阵法防御禁制','战胜心魔，破阵而出','宁幽城外也出现了妖兽，击杀！'},
__fields = {
	'Id',
	'MainTitle',
	'Content',
	'Desc',
	'Reward',
	'NextMissionPos',
	'Target',
	'ChildMission'
},
__defaults = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
__refs = {
	{183,1,-3,4,1.8,-11,12,1.8,-21,22,1.8,-29,30,1.2,-44,.3,1,2.1,4.1,.3,-4,.3},
	{215,1.53,-82,.3,7,.3,1,2.1,.3,-9,.7},
	{166,.95},
	{{{1},{13,1.02,134,.83}}},
	{{{1,1},{34,1,5,3,10,2,6,8,10,6,7,4,6,10,-4.2,1,11,-7.2,8,13,.41,-166,.32}},{{2,1},{36,5,3,-6.3,8,10,6,7,4,6,10,-112,0,121,11,-7.2,8,-154,.51},{1,21,1.41,5,1.7}},{{3,1},{37,5,3,6,5,7,8,10,-80,0,100,3,9,4,-116,123,10,6,-8.2,-155,.3},{2,1.91,28,1.3}},{{4,1},{39,7,-5.2,-9.2,8,6,-5.2,7,8,4,-116,124,10,5,8,9,-156,.3},{-2.2,1.71,28,1.3}},{{5,1},{38,9,7,2,11,7,8,-6.2,5,7,6,5,3,7,9,3,11,7,-156,.3},{-2.2,1.71,28,1.3}},{{5,2},{49,8,18,8,6,29,40},{4,-2.2,1.2,5,6}},{{6,1},{43,12,13,8,-6.2,7,5,7,9,12,9,6,-8.2,-158,.3},{4,2,1.7,-2.2,1.4,28,1.3}},{{6,2},{48,35,6,71},{4,5,1,11}},{{3,2},{52,5,7,8,42,4,23,8},{5,1.3,6,1,4,1}},{{4,2},{52,5,-9.2,8,6,25,4,8,15,8,9},{5,1.5,4,1,-2.2,1.2}},{{2,2},{-57.2,9,18},{6,8,3,2}},{{2,3},{58,57,27},{6,8,5}},{{2,4},{59},{6}},{{3,3},{58,15,42,4,23},{6,2,6,1,4}},{{3,4},{59},{6}},{{4,3},{58,26,6,25,4,23},{6,3,1,4,2.1}},{{4,4},{59},{6}},{{5,3},{58,26,6,29},{6,3,1,5}},{{5,4},{59},{6}},{{7,1},{60,17,4,6,21,20,10,6,8,7},{6,2,1.2,3,4,1.4}},{{8,1},{55,23,-77,86,41,4,13,-8.2},{6,2,1.2,7,1.4}},{{6,3},{84,6},{9,1}},{{9,1},{1,90,38,10,22},{9,1,7,-2.2}},{{10,1},{1,130,32},{9,8,4}},{{7,2},{109,51},{13,8}},{{7,3},{110},{13}},{{7,4},{111},{13}},{{9,2},{130,32},{17,4}},{{8,2},{162},{21}},{{10,2},{164},{21}},{{10,3},{165},{21}},{{11,1},{163},{21}},{{11,2},{164},{21}},{{11,3},{165},{21}},{{12,1},{163},{21}},{{12,2},{164},{21}},{{12,3},{165},{21}},{{13,1},{162},{21}}},
	{251,1.53,-117,.3,9,.3,1,2.1,.3,-11,.7},
	{{{1,1},{1,.53,1,.3,-1,.7,1,.11}},{{1,2},{1,.53,2,.3,-2,.7,5,.3,-3,.7}},{{2,1},{1,.3,2,0,-2,.5,2,-2,7.2,-2,.61,1,.51},{1,40,1.7}},{{2,2},{1,.3,5,-2,-3,.5,4,-4,.3,3.2,.61,2,.3,3,.3,-3,.7},{1,40,1.7}},{{3,1},{1,.2,3,-1,0,-2,.4,5.2,1,-3,.2,2,4.2,.11,1,.3},{1,21,1,6,5,3,1.11,5,1.7}},{{3,2},{1,.2,4,1,-2,-3,.4,5,-1,1,-5,.2,4,0,-4,.11,5,.3},{1,21,1,6,5,3,1.11,5,1.7}},{{4,1},{1,0,3,-1,-2,4,.2,-4,7.3,1,-3,0,4,-2,1.2,-4,.3,1,.3},{-2.2,1.71,5,2,3,4,14,1.3}},{{4,2},{1,0,4,1,-5,5,1,0,-6,0,5,-1,9.2,5.3,0,6.2,.3,5,.3},{-2.2,1.71,5,2,3,4,14,1.3}},{{5,1},{1,.2,2,-2,4,.2,-4,0,3,-3,2.1,5,-1,8.2,4,-3,.3},{-2.2,1.71,28,1.3}},{{5,2},{1,.2,5,-5,5,1,0,-6,0,7.3,-5,6,-1,-5,0,5,.4},{-2.2,1.71,28,1.3}},{{6,1},{1,.3,4,0,-4,.3,5,-5,.2,6,-6,.3},{4,2,1.7,-2.2,1.4,28,1.3}},{{6,2},{1,.3,6,0,-6,4.2,-6,.2,7,-7,.3},{4,2,1.7,-2.2,1.4,28,1.3}},{{7,1},{1,.4,7,-7,.2,6},{6,2,1.2,3,4,1.4}},{{7,2},{1,.4,8,-8,.2,7},{6,2,1.2,3,4,1.4}},{{8,1},{1,0,8,-8,7,-7,.2,8},{6,2,1.2,7,1.4}},{{8,2},{1,0,10,-10,8,-8,.2,9},{6,2,1.2,7,1.4}},{{9,1},{9,-8,.2,8},{9,1,7,-2.2}},{{9,2},{11,-10,.2,9},{9,1,7,-2.2}},{{10,1},{9,-8,10},{9,8,4}},{{10,2},{11,-10,11},{9,8,4}},{{11,1},{11},{21}},{{11,2},{12},{21}},{{12,1},{11},{21}},{{12,2},{12},{21}},{{13,1},{1},{21}},{{13,2},{1},{21}}}
},
__refPoss = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
}
return ChallengeMissionConfig