local DifferDemonsStageConfig = {
__count = 200,
__indexs = {101,1.91,81,2.1,4.1,8.1,4.3},
__values = {1.12,-2.2,1,-3.2,1,4.2,2,1,4,5,10,-20.71,80,-120.2,80,40,120,40,6.1,12.7,120,-200.8,496101,1.91,81,2.1,4.1,8.1,4.3},
__exVals = {156,nil,null,'伤害增加至{40000点}','伤害增加至{70000点}','伤害增加至{100000点}','增益效果时间增加至{8秒}','增益效果时间增加至{10秒}','伤害增加至{16000点}','伤害增加至{50000点}','伤害增加至{60000点}','伤害增加至{80000点}','伤害增加至{140000点}','流血效果提升至{8秒4次伤害}','流血效果提升至{10秒5次伤害}','伤害增加至{25000点}','伤害增加至{36000点}','伤害增加至{20000点}','伤害增加至{90000点}','伤害增加至{110000点}','伤害增加至{130000点}','伤害增加至{150000点}','伤害增加至{120000点}','伤害增加至{7000点}','流血伤害增加至每次{1400点}','伤害增加至{10000点}','流血伤害增加至每次{2000点}','伤害增加至{13000点}','流血伤害增加至每次{2600点}','流血伤害增加至每次{3200点}','目标伤害加深增加至{10%}','伤害增加至{19000点}','流血伤害增加至每次{3800点}','目标伤害加深增加至{20%}','伤害增加至{22000点}','流血伤害增加至每次{4400点}','目标伤害加深增加至{30%}','目标伤害加深增加至{50%}','伤害增加至{11000点}','气血回复增加至{12000点}','气血回复增加至{16000点}','伤害增加至{21000点}','气血回复增加至{20000点}','伤害增加至{26000点}','气血回复增加至{24000点}','伤害增加至{31000点}','{6秒}内增加{30%}双抗','气血回复增加至{28000点}','{6秒}内增加{40%}双抗','气血回复增加至{32000点}','双抗提升时间增加至{10秒}','{10秒}内增加{50%}双抗','伤害增加至{41000点}','气血回复增加至{36000点}','{10秒}内增加{60%}双抗','伤害增加至{12000点}','眩晕概率提升至{30%}','眩晕概率提升至{40%}','眩晕目标增加至{2个}','眩晕概率提升至{50%}','伤害增加至{24000点}','眩晕概率提升至{60%}','眩晕目标增加至{3个}','伤害增加至{28000点}','眩晕概率提升至{70%}','伤害增加至{32000点}','眩晕概率提升至{80%}','眩晕目标增加至{4个}','眩晕概率提升至{90%}','眩晕概率提升至{100%}','速度提升增加至{35%}','伤害增加至{30000点}','速度提升增加至{40%}','速度提升时间增加至{8秒}','速度提升增加至{45%}','速度提升增加至{50%}','施法率提升至{30%}','速度提升增加至{55%}','施法率提升至{40%}','速度施法率提升时间增加至{10秒}','速度提升增加至{60%}','施法率提升至{50%}','速度提升增加至{65%}','灼烧伤害增加至每次{6000点}','攻击提升增加至{60%}','灼烧效果提升至{8秒4次伤害}','灼烧伤害增加至每次{7000点}','攻击提升增加至{70%}','伤害增加至{55000点}','灼烧伤害增加至每次{8000点}','攻击提升增加至{80%}','灼烧伤害增加至每次{9000点}','攻击提升增加至{90%}','伤害增加至{85000点}','灼烧效果提升至{10秒5次伤害}','灼烧伤害增加至每次{10000点}','攻击提升增加至{100%}','灼烧伤害增加至每次{11000点}','伤害减免提升至{35%}','免疫控制概率提升至{60%}','伤害减免提升至{40%}','免疫控制概率提升至{70%}','伤害减免提升至{45%}','免疫控制概率提升至{80%}','伤害减免提升至{50%}','免疫控制概率提升至{90%}','伤害减免提升至{55%}','免疫控制概率提升至{100%}','伤害减免提升至{60%}','暴击率增加至{20%}','施法率增加至{60%}','暴击率增加至{30%}','施法率增加至{70%}','暴击率增加至{40%}','施法率增加至{80%}','暴击率增加至{50%}','施法率增加至{90%}','暴击率增加至{60%}','施法率增加至{100%}','暴击率增加至{70%}','流血伤害增加至每次{3000点}','减甲效果提升至{40%}','流血伤害增加至每次{4000点}','减甲效果提升至{55%}','流血伤害增加至每次{5000点}','减甲效果提升至{70%}','流血伤害增加至每次{6000点}','减甲效果提升至{85%}','流血伤害增加至每次{7000点}','减甲效果提升至{100%}','流血伤害增加至每次{8000点}','护盾值提升至{20000点}','免疫负面状态概率提升至{60%}','护盾值提升至{30000点}','免疫负面状态概率提升至{70%}','护盾值提升至{40000点}','免疫负面状态概率提升至{80%}','护盾值提升至{50000点}','免疫负面状态概率提升至{90%}','护盾值提升至{60000点}','免疫负面状态概率提升至{100%}','护盾值提升至{70000点}','伤害加成增加至{40%}','伤害减免增加至{40%}','伤害加成增加至{50%}','伤害减免增加至{50%}','伤害增加至{180000点}','伤害加成增加至{60%}','CD减免时间增加至{4秒}','伤害减免增加至{60%}','伤害增加至{220000点}','伤害加成增加至{70%}','伤害减免增加至{70%}','伤害增加至{260000点}','伤害加成增加至{80%}','伤害减免增加至{80%}','伤害增加至{300000点}'},
__fields = {
	'ID',
	'SkillId',
	'PassiveSkillId',
	'SkillChangeDesc',
	'Cost',
	'ComonpentPreStage'
},
__defaults = {
	nil,
	nil,
	nil,
	nil,
	nil
},
__refs = {
	{84,1.991},
	{},
	{284,22,1.3,-13,14,1,-20,21,1.5,3.2,1,-21,22,-36,37,1,-31,32,1.8,-32,33,1.5,-53,54,1,-48,49,1,-41,42,1.8,-51,52,-65,66,-68,16,53,1.3,-70,71,8.2,1,-66,67,1,-74,75,1.2,11.2,-81,14,68,1,-81,82,1.5,-86,87,1.5,-91,92,-96,8,89,1,-95,2,94,1,-83,84,1,-84,85,1,-85,-13,99,1,23.2,-107,8,100,1,-106,2,105,1,-94,95,27.2,96,1,-96,-13,110,1,-97,98,-118,2,117,1,-111,3,109,1,-112,113,1,-120,121,1,-105,-8,114,1,-117,118,-129,2,128,1,-122,-4,127,1,-123,124,1,-131,132,1,-116,-15,4.2,-128,129,-140,4,137,13.2,-6,138,1.8,-145,146,1.3},
	{{{1,1},{285,-280,.81,280,3.1,6.1,12.1,6.5}},{{1,2},{31,4,1.71,-21,3.1,6.5,-8,6,3,1.2,2,1,2,4.1,4.1,1,-31,16.1,32.1,16.51,-23,-2.2,3,2.1,2.1,2,1.8},{1,-20.9}},{{2,1},{6,.561},{1.7,14,1.6,2.1,4.3,-20.5}},{{2,2},{1,.2,1,.3,1,.4,1,-3,7.1,14.1,0,1,0,1,0,1.2,-3.5,-2.2,1.2,-2.2,-29,11.1,22.1,11.01,-28,11.5,-2.2,4,-3.3,-2.4,3,1.2},{1.7,14,1.6,2.1,4.3,-20.5}}},
	{1.02,-19,1.91,2.1,4.1,8.1,2.1}
},
__refPoss = {
	nil,
	nil,
	nil,
	nil,
	nil
},
}
return DifferDemonsStageConfig