local EncourageTaskConfig = {
__count = 270,
__indexs = {1001,1.21,988,2.1,1.01,990,2.1,4.1,2.1,1.91,981,1.02,980,1.27,928,1.32,977,1.41,986,1.11,989,2.1,1.11},
__values = {1.37,2,5,-10.2,-5.2,2.1,-10.2,5,-15.2,8.2,5,15,10,11.3,10,15,18.3,5.4,19.4,27.5,23.4,28.6,16.5,6.1,22.91,-10.5,20,-10.2,-20.2,800,8441,1,2,6569,1,43388,1,11600,1.2,26996,999,100000,800000,-500000.2,4000104,6,910},
__exVals = {270,'神之塔通关第60层','神之塔通关第70层','神之塔通关第80层','神之塔通关第90层','神之塔通关第100层','神之塔通关第120层','神之塔通关第140层','神之塔通关第160层','神之塔通关第180层','神之塔通关第200层','神之塔通关第220层','神之塔通关第240层','神之塔通关第250层','神之塔通关第260层','神之塔通关第270层','神之塔通关第280层','神之塔通关第290层','神之塔通关第300层','神之塔通关第320层','神之塔通关第340层','神之塔通关第360层','神之塔通关第380层','神之塔通关第400层','神之塔通关第420层','神之塔通关第440层','神之塔通关第450层','神之塔通关第460层','神之塔通关第470层','神之塔通关第480层','神之塔通关第490层','神之塔通关第500层','神之塔通关第510层','神之塔通关第520层','神之塔通关第540层','神之塔通关第560层','神之塔通关第580层','神之塔通关第600层','神之塔通关第610层','神之塔通关第620层','神之塔通关第630层','神之塔通关第640层','神之塔通关第650层','神之塔通关第660层','神之塔通关第670层','神之塔通关第690层','神之塔通关第710层','神之塔通关第730层','神之塔通关第750层','神之塔通关第760层','神之塔通关第770层','神之塔通关第780层','神之塔通关第790层','神之塔通关第800层','神之塔通关第810层','神之塔通关第820层','神之塔通关第840层','神之塔通关第860层','神之塔通关第880层','神之塔通关第900层','神之塔通关第910层','神之塔通关第920层','神之塔通关第930层','神之塔通关第940层','神之塔通关第950层','神之塔通关第960层','神之塔通关第970层','神之塔通关第990层','神之塔通关第1010层','神之塔通关第1030层','神之塔通关第1050层','神之塔通关第1060层','神之塔通关第1070层','神之塔通关第1080层','神之塔通关第1090层','神之塔通关第1100层','神之塔通关第1110层','神之塔通关第1120层','神之塔通关第1140层','神之塔通关第1160层','神之塔通关第1180层','神之塔通关第1200层','魔之塔获得星数达到：15','魔之塔获得星数达到：30','魔之塔获得星数达到：45','魔之塔获得星数达到：60','魔之塔获得星数达到：75','魔之塔获得星数达到：90','魔之塔获得星数达到：105','魔之塔获得星数达到：120','魔之塔获得星数达到：135','魔之塔获得星数达到：150','魔之塔获得星数达到：165','魔之塔获得星数达到：180','魔之塔获得星数达到：195','魔之塔获得星数达到：210','魔之塔获得星数达到：225','魔之塔获得星数达到：240','魔之塔获得星数达到：255','魔之塔获得星数达到：270','魔之塔获得星数达到：285','魔之塔获得星数达到：300','异端之战通关1层','异端之战通关2层','异端之战通关4层','异端之战通关6层','异端之战通关8层','异端之战通关10层','异端之战通关12层','异端之战通关14层','异端之战通关16层','异端之战通关18层','异端之战通关20层','异端之战通关22层','异端之战通关24层','异端之战通关26层','异端之战通关28层','异端之战通关30层','异端之战通关32层','异端之战通关34层','异端之战通关36层','异端之战通关38层','异端之战通关40层','迷雾之战获得星数达到：3','迷雾之战获得星数达到：15','迷雾之战获得星数达到：30','迷雾之战获得星数达到：45','迷雾之战获得星数达到：60','迷雾之战获得星数达到：75','迷雾之战获得星数达到：90','迷雾之战获得星数达到：105','迷雾之战获得星数达到：120','迷雾之战获得星数达到：135','迷雾之战获得星数达到：150','迷雾之战获得星数达到：165','迷雾之战获得星数达到：180','迷雾之战获得星数达到：195','迷雾之战获得星数达到：210','迷雾之战获得星数达到：225','迷雾之战获得星数达到：240','迷雾之战获得星数达到：255','迷雾之战获得星数达到：270','迷雾之战获得星数达到：285','迷雾之战获得星数达到：300','迷雾之战获得星数达到：315','迷雾之战获得星数达到：330','迷雾之战获得星数达到：345','迷雾之战获得星数达到：360','迷雾之战获得星数达到：375','迷雾之战获得星数达到：390','迷雾之战获得星数达到：405','迷雾之战获得星数达到：420','迷雾之战获得星数达到：435','迷雾之战获得星数达到：450','迷雾之战获得星数达到：465','迷雾之战获得星数达到：480','迷雾之战获得星数达到：495','迷雾之战获得星数达到：510','迷雾之战获得星数达到：525','迷雾之战获得星数达到：540','迷雾之战获得星数达到：555','迷雾之战获得星数达到：570','迷雾之战获得星数达到：585','迷雾之战获得星数达到：600','迷雾之战获得星数达到：615','迷雾之战获得星数达到：630','迷雾之战获得星数达到：645','迷雾之战获得星数达到：660','迷雾之战获得星数达到：675','迷雾之战获得星数达到：690','迷雾之战获得星数达到：705','迷雾之战获得星数达到：720','迷雾之战获得星数达到：735','迷雾之战获得星数达到：750','迷雾之战获得星数达到：765','迷雾之战获得星数达到：780','迷雾之战获得星数达到：795','迷雾之战获得星数达到：810','迷雾之战获得星数达到：825','迷雾之战获得星数达到：840','迷雾之战获得星数达到：855','迷雾之战获得星数达到：870','迷雾之战获得星数达到：885','迷雾之战获得星数达到：900','迷雾之战获得星数达到：915','迷雾之战获得星数达到：930','迷雾之战获得星数达到：945','迷雾之战获得星数达到：960','迷雾之战获得星数达到：975','迷雾之战获得星数达到：990','迷雾之战获得星数达到：1005','迷雾之战获得星数达到：1020','迷雾之战获得星数达到：1035','迷雾之战获得星数达到：1050','迷雾之战获得星数达到：1065','迷雾之战获得星数达到：1080','深渊试炼通关40层','深渊试炼通关50层','深渊试炼通关60层','深渊试炼通关70层','深渊试炼通关80层','深渊试炼通关90层','深渊试炼通关100层','深渊试炼通关110层','深渊试炼通关120层','深渊试炼通关130层','深渊试炼通关140层','深渊试炼通关150层','深渊试炼通关160层','深渊试炼通关180层','深渊试炼通关200层','深渊试炼通关220层','深渊试炼通关240层','深渊试炼通关250层','深渊试炼通关260层','深渊试炼通关280层','深渊试炼通关300层','深渊试炼通关320层','深渊试炼通关340层','深渊试炼通关350层','深渊试炼通关360层','深渊试炼通关380层','深渊试炼通关400层','深渊试炼通关420层','深渊试炼通关440层','深渊试炼通关450层','深渊试炼通关460层','深渊试炼通关480层','深渊试炼通关500层','深渊试炼通关520层','深渊试炼通关540层','深渊试炼通关550层','深渊试炼通关560层','深渊试炼通关580层','深渊试炼通关600层','深渊试炼通关620层','深渊试炼通关640层','深渊试炼通关650层','深渊试炼通关660层','深渊试炼通关680层','深渊试炼通关700层','深渊试炼通关720层','深渊试炼通关740层','深渊试炼通关750层','深渊试炼通关760层','深渊试炼通关780层','深渊试炼通关800层','深渊试炼通关820层','深渊试炼通关840层','深渊试炼通关850层','深渊试炼通关860层','深渊试炼通关880层','深渊试炼通关900层','深渊试炼通关920层','深渊试炼通关940层','深渊试炼通关950层','深渊试炼通关960层','深渊试炼通关980层','深渊试炼通关1000层','深渊试炼通关1020层','深渊试炼通关1040层','深渊试炼通关1050层','深渊试炼通关1060层','深渊试炼通关1080层','深渊试炼通关1100层','深渊试炼通关1120层','深渊试炼通关1140层','深渊试炼通关1150层','深渊试炼通关1160层','深渊试炼通关1180层','深渊试炼通关1200层'},
__fields = {
	'Id',
	'EncouragePlan',
	'Level',
	'TaskRequire',
	'Nouse2',
	'FreeReward',
	'PrivilegeReward'
},
__defaults = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
__refs = {
	{1,.21,2.1,1,.01,2.1,4.1,4.3,.91,1,.02,1,.27,1,.32,1,.41,1,.11,2.1,2.1},
	{1.31,-12,1.21,-12,1.01,-10,2.1,4.1,2.1,1.91,-19,1.02,-20,1.27,-72,1.32,-23,1.41,-14,1.11,-11,2.1,1.11},
	{60,10,5,1.2,-3.2,-2.5,1,2,1.2,2,1,-2.2,3,-2.4,6.2,2.1,2.1,3,-2.2,16.4,23.2,2,3,8.5,16.31,1.6,8.2,-191,-15.3,14,-2.6,1.2,19.2,-2.4,-100,1,-2.91,-37,12,12.7,1,-2.3,63.2,1.2,-2.6,6.3,-2.51,4.3,-2.21,-157,-10.3,85.2,50.4,23.2,84.2,15.2,86.2,-3.2,34.2,-2.3,69.3,3,2,-3.2,11.1,1.2,7.2,1.5},
	{227,1.962},
	{{{1,1},{3,.52,11,.45,211,.91,-209,.02,194,.27,-191,-3,.9,3,-3,.4,3.1,3,0,-3,.3,10.5,0,3.1,9.8,15.9,12.8}},{{1,2},{219,.21,1,2.1,.01,2.1,1,.23,-146,.91,-57,.02,-10,.27,-9,49,.9,-49,49,.4,3.1,-49,0,76,.3,-76,76,.4,3.2,0,3.1,9.8,15.9,12.8}},{{2,1},{4,.02,15,.4,196,0,9,.11},{-3.2,7,2.1,3,-4.2,2.1,4.1,3,-4.7,11,10,7,-6.11}},{{2,2},{77,.02,-76,.81},{-3.2,7,2.1,3,-4.2,2.1,4.1,3,-4.7,11,10,7,-6.11}}},
	{{{1,1},{4,0,12,-12,3.1,.5,6.5,9.1,.2,3.1,9.1,18.1,18.01,196,.91,3,2,-2,2.1,4.1,8.1,4.1,-5,.6,-2,.3,1,0,-1,4.1,8.1,16.1,12.11,-193,.47}},{{1,2},{101,0,23,-23,3.1,.5,23,.86,-119,.2,45,-45,3.1,6.1,3.2,-49,.02,49,.6,-40,0,10,0,-14,0,4,6.1,12.1,24.1,18.71,118,-74,.9,74,-74,.4,3.1,74,83,-130,.3,130,3.2,109,21,-130,0,130,0,-130,10.2,.4,3.2,12.2,9.2,17.2,-109,16.2,10.2,0,23.2,19.7}},{{2,1},{226,.52,-13,0,1,-1,.2,3.1,3.2,9.1,18.1,9.8,-3,.91,-195,200,-200,2.1,4.1,8.1,4.1,208,.11,-6,6,.4,3.1,6.1,12.1,9.7,8,.01,-207,207,.4,3.1,6.5,.3,-207,0,207,0,4.3,13.5,8.3,6.3,15.2,9.2,.2,17.8}},{{2,2},{10,0,40,-40,3.1,.5,6.5,9.5,-49,.45,19,.2,69,-69,3.1,6.1,3.2,-12,-74,74,2.1,4.1,8.1,4.3,121,-119,.2,-3,.2,3,-3,.4,-1,1,3.1,6.1,12.1,9.8,49,-40,.22,83.2,.52,3.2,.22}}}
},
__refPoss = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
}
return EncourageTaskConfig