local EndlessTask = {
__count = 23,
__indexs = {9000,1.01,991,1.9,4,1},
__values = {0,1.81,2,1,2,1.3,4,1,19,10,20,22,21,1.4,2,1,1071,34827,3972},
__exVals = {13,'击败1个小怪','士气等级提升至3级','士气等级提升至5级','士气等级提升至8级','击败10个小怪','击败30个小怪','击败50个小怪','击败3个boss','击败最终boss','购买1次行动力','购买3次行动力','开启5个小宝箱','开启5个大宝箱'},
__fields = {
	'Id',
	'Type',
	'Values',
	'Desc',
	'Reward',
	'Jump',
	'ViewDateUp',
	'ViewDataDown'
},
__defaults = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
__refs = {
	{33,.01,-1,.2,1,.2,1.3,0,1.2},
	{{{1,1},{1,.22}},{{2,1},{2,.01,-2.2,3,2,15,2,-24,-2,0,-2.2,0}}},
	{42,.01,1.21},
	{{{1,1},{17,.21,22,-22,12,-14,2,5,-17,34,.2}},{{1,2},{6,.01,14,0,10,-10,-18,39,-15,-23,17,8,2,0}},{{2,1},{31,.22}},{{2,2},{2,1.01,14,-2.2,-19,9,6,4,0,-4,2,1,0}}},
	{1,.81,39,0,-39,0},
	{2,5,-2.9,-23,.11},
	{6,-2.9,3,.21}
},
__refPoss = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
}
return EndlessTask