local ExpeditionHolyConfig = {
__count = 122,
__indexs = {1.221},
__values = {1.54,455,500,520,29,451,8014,3,989,495,1,8,5,486,1.3,14,4,1.2,3,11,4,3,1.2,964,90,224,676,-3.2,2007,2,12,7,73970,6,2,169994,11,8,1.2,7,2,10,2,4739952,1.63,64,1.14,59,1.24},
__exVals = {168,nil,'避水符','破军符','遗护镜','戮仙石','麒麟甲','回生石','杏黄旗','降头令','愈体丸','疗心戒','昆仑镜','干将【雄】','莫邪【雌】','瘟癀碟','蚩尤斧','长生铠','历战剑','摄魂刀','破邪杵','背水戒','虚影护','琉璃铠','獬豸符','会心符','断骨爪','【佛】珠','【人】药','【道】玉','【妖】晶','【佛】杖','【人】剑','【道】符','【妖】刀','绝境令','聚宝盆','瘟毒伞','争先令','炼妖壶','终临符','斩仙刀','仙桃盘','复苏印','舍利子','震天刺','阴阳玉','前排神将伤害减免+15%，闪避几率+10%','后排神将增伤+15%，暴击+10%','己方前排全部阵亡后，己方后排减伤+20%','输出和控制神将增伤+10%','辅助和肉盾神将减伤+10%','第二回合开始时，恢复我方血量最低神将20%最大生命','战斗开始时，己方当前生命高于95%的神将攻击+15%','开始时随机一名敌人受到伤害增加20%，持续1回合。目标死亡转移给另一名敌人','战斗结束后恢复存活友军16%已损失生命','战斗开始时恢复己方神将自身生命上限6%','敌方首次使用技能时，我方获得生命上限15%护盾，持续1回合','己方神将造成伤害时，50%概率降低12%增伤。同时拥有【雌】时，降低的增伤加给造成伤害者','己方神将造成伤害时，50%概率降低12%减伤。同时拥有【雄】时，降低的减伤加给造成伤害者','非治疗神将普攻50%概率附加中毒，可叠加。固定造成15%攻击的真伤','己方非治疗神将每次造成伤害有40%概率附加穿透攻击造成额外伤害（【穿透攻击】造成自身攻击力40%的无视防御伤害。）','获得后，每场胜利获得4%生命上限，最多5层','获得后，每场胜利获得4%攻击，最多5层','杀敌回复自身16%最大生命','目标生命值越高，造成伤害越高，最高20%','己方神将血量越低，造成伤害越高，最多25%','敌方被治疗量-35%','闪避+12%','减伤+12%','增伤+12%','暴击+12%','暴击伤害+12%','佛阵营神将每回合攻击+3%，可叠加','人阵营神将每回合回复10%已损失生命','道阵营神将每回合获得自身生命上限6%护盾，持续1回合','妖阵营神将每回合15%回复一点怒气','每有一个佛阵营神将，增加己方闪避3%','上阵神将中每有一个人阵营神将使己方神将暴击+3%','每有一个道阵营神将，增加己方抗暴3%','上阵神将中每有一个妖阵营神将使己方神将命中+3%','根据舍利子的数量获得属性，2件：伤害减免+15%，3件：伤害加成+25%，4件：暴击率+40%','仅在第三层中，攻击生命+15%','每有一件紫或橙的圣物，生命和攻击+1.5%，最多15%','前排神将伤害减免+20%，闪避几率+15%','后排神将增伤+20%，暴击+15%','己方前排全部阵亡后，己方后排减伤+30%','输出和控制神将增伤+15%','辅助和肉盾神将减伤+15%','第二回合开始时，恢复我方血量最低神将30%最大生命','战斗开始时，己方当前生命高于95%的神将攻击+25%','开始时随机一名敌人受到伤害增加30%，持续1回合。目标死亡转移给另一名敌人。','战斗结束后恢复存活友军28%已损失生命','战斗开始时恢复己方神将自身生命上限9%','敌方首次使用技能时，我方获得生命上限25%护盾，持续1回合','己方神将造成伤害时，50%概率降低16%增伤。同时拥有【雌】时，降低的增伤加给造成伤害者','己方神将造成伤害时，50%概率降低16%减伤。同时拥有【雄】时，降低的减伤加给造成伤害者','非治疗神将普攻50%概率附加中毒，可叠加。固定造成25%攻击的真伤','己方非治疗神将每次造成伤害有40%概率附加穿透攻击造成额外伤害（【穿透攻击】造成自身攻击力60%的无视防御伤害。）','获得后，每场胜利获得6%生命上限，最多5层','获得后，每场胜利获得6%攻击，最多5层','杀敌回复自身24%最大生命','目标生命值越高，造成伤害越高，最高30%','己方神将血量越低，造成伤害越高，最多35%','敌方被治疗量-50%','闪避+18%','减伤+18%','增伤+18%','暴击+18%','暴击伤害+18%','佛阵营神将每回合攻击+5%，可叠加','人阵营神将每回合回复15%已损失生命','道阵营神将每回合获得自身生命上限9%护盾，持续1回合','妖阵营神将每回合25%回复一点怒气','每有一个佛阵营神将，增加己方闪避5%','上阵神将中每有一个人阵营神将使己方神将暴击+5%','每有一个道阵营神将，增加己方抗暴4%','上阵神将中每有一个妖阵营神将使己方神将命中+5%','仅在第三层中，攻击生命+25%','每有一件紫或橙的圣物，生命和攻击+2%，最多20%','战斗开始时回复1点怒气','每当敌方神将死亡时己方神将伤害加成+6%伤害减免+6%','每当己方神将死亡时己方神将伤害加成+10%，伤害减免+10%','斩杀生命低于10%的敌人','使用蟠桃树疗伤时会额外回复30%生命值','每使用1次判官笔己方神将攻击加成+40%，最多120%','前排神将伤害减免+25%，闪避几率+20%','后排神将增伤+25%，暴击+20%','己方前排全部阵亡后，己方后排减伤+50%','输出和控制神将增伤+25%','辅助和肉盾神将减伤+25%','第二回合开始时，恢复我方血量最低神将50%最大生命','战斗开始时，己方当前生命高于95%的神将攻击+35%','开始时随机一名敌人受到伤害增加50%，持续1回合。目标死亡转移给另一名敌人。','战斗结束后恢复存活友军40%已损失生命','战斗开始时恢复己方神将自身生命上限15%','敌方首次使用技能时，我方获得生命上限35%护盾，持续1回合','己方神将造成伤害时，50%概率降低20%增伤。同时拥有【雌】时，降低的增伤加给造成伤害者','己方神将造成伤害时，50%概率降低20%减伤。同时拥有【雄】时，降低的减伤加给造成伤害者','非治疗神将普攻50%概率附加中毒，可叠加。固定造成35%攻击的真伤','己方非治疗神将每次造成伤害有40%概率附加穿透攻击造成额外伤害（【穿透攻击】造成自身攻击力100%的无视防御伤害。）','获得后，每场胜利获得8%生命上限，最多5层','获得后，每场胜利获得8%攻击，最多5层','杀敌回复自身36%最大生命','目标生命值越高，造成伤害越高，最高50%','己方神将血量越低，造成伤害越高，最多50%','闪避+25%','减伤+25%','增伤+25%','暴击+25%','暴击伤害+25%','佛阵营神将每回合攻击+8%，可叠加','人阵营神将每回合回复25%已损失生命','道阵营神将每回合获得自身生命上限12%护盾，持续1回合','妖阵营神将每回合35%回复一点怒气','每有一个佛阵营神将，增加己方闪避8%','上阵神将中每有一个人阵营神将使己方神将暴击+8%','每有一个道阵营神将，增加己方抗暴5%','上阵神将中每有一个妖阵营神将使己方神将命中+8%','仅在第三层中，攻击生命+35%','每有一件紫或橙的圣物，生命和攻击+3%，最多30%','战斗开始时回复2点怒气','每当敌方神将死亡时己方神将伤害加成+10%伤害减免+10%','每当己方神将死亡时己方神将伤害加成+15%，伤害减免+15%','斩杀生命低于15%的敌人','使用蟠桃树疗伤时会额外回复50%生命值','每使用1次判官笔己方神将攻击加成+80%，最多240%','敌方首回合受到伤害时，对其他所有敌人造成10%伤害','第三回合开始对敌方全体神将造成20%生命上限的伤害（不致死）和50%概率1回合眩晕'},
__fields = {
	'Id',
	'Name',
	'type',
	'effect',
	'Describe',
	'PassiveSkillId',
	'ForceType',
	'Icon',
	'SpecialIcon'
},
__defaults = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
__refs = {
	{217,1.91,16,-15,1.21,10,-9,1,-34,8.3,1.41,2,1.5,-41,1.43,4.2,2,1},
	{1,.63,1,.14,1,.24},
	{1.73,-36,1.33,2,1.7,-42,1.91,2,1.21,2,1.9},
	{262,1.121},
	{94,1.121},
	{46,.63,1,.14,3,.24},
	{53,12,-14,9,20,-31,5,8,6,1,-14,33,4,-26,21,-10,14,2,-7,4,-7,-5,-6,-11,-9,27,2,-14,3,-6,25,-4,-29,19,-4,-12,25,-31,37.33,-16,25,-26,24,-25,17,-26,28,-23,42.91,-12,41.02,-3,-10},
	{{{1},{1,.32},{27,1.7,30,1.7,34,1.7}},{{2},{2,-1,3,-1,-1,4.1,8.1,8.7},{27,1.7,30,1.7,34,1.7}}}
},
__refPoss = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
}
return ExpeditionHolyConfig