local HeroRankupGroup = {
__count = 53,
__indexs = {1.35},
__values = {-2,1.3,2,1.9,989,1,6799,2210,1.4,13,1.4,15,1.4,16,1.3,2.1},
__exVals = {53,'3星同名','4星同名','5星同名','6星同名','7星同名','8星同名','9星同名','10星同名','11星同名','12星同名','3星任意','4星任意','5星任意','6星任意','7星任意','8星任意','9星任意','10星任意','11星任意','12星任意','3星同系','4星同系','5星同系','6星同系','7星同系','8星同系','9星同系','10星同系','11星同系','12星同系','居里夫人','俾斯麦','弗兰肯斯坦','亚森罗宾','威廉·基德','佐罗','斯巴达','花木兰','弗洛伊德','雨果','肖邦','玛利亚','唐吉坷德','帕里斯','拿破仑','哥白尼','毕达哥拉斯','血腥玛丽','弑君者詹姆','开膛手杰克','尼禄','土方岁三','乔'},
__fields = {
	'Id',
	'Issame',
	'StarLimit',
	'IsSameClan',
	'IsId',
	'Name',
	'Jump'
},
__defaults = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
__refs = {
	{4,.9,-1,.24},
	{5,1.9,-9,2.1,1.9,-7,.22},
	{4,.9,-1,.9,1,4.2,.22},
	{3,.92,15,1.3,2,1.2,2,1.31,-14,-4},
	{41,1.25},
	{{{1},{2,.9,13,.91,-14,.22}},{{2},{16,.8,1,-1,.7},{12,1.8,2,1.8}},{{3},{17,-1},{12,10}}}
},
__refPoss = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
}
return HeroRankupGroup