local JewelConfig = {
__count = 40,
__indexs = {100001,1.93},
__values = {1.01,-2.2,4,2,4,6,-10.2,99950,200000,700000,2000000,7000000},
__exVals = {40,'火属性绿色魂宝','火属性蓝色魂宝','火属性紫色魂宝','火属性橙色魂宝','火属性红色魂宝','火属性绿色灵宝','火属性蓝色灵宝','火属性紫色灵宝','火属性橙色灵宝','火属性红色灵宝','风属性绿色魂宝','风属性蓝色魂宝','风属性紫色魂宝','风属性橙色魂宝','风属性红色魂宝','风属性绿色灵宝','风属性蓝色灵宝','风属性紫色灵宝','风属性橙色灵宝','风属性红色灵宝','水属性绿色魂宝','水属性蓝色魂宝','水属性紫色魂宝','水属性橙色魂宝','水属性红色魂宝','水属性绿色灵宝','水属性蓝色灵宝','水属性紫色灵宝','水属性橙色灵宝','水属性红色灵宝','地属性绿色魂宝','地属性蓝色魂宝','地属性紫色魂宝','地属性橙色魂宝','地属性红色魂宝','地属性绿色灵宝','地属性蓝色灵宝','地属性紫色灵宝','地属性橙色灵宝','地属性红色灵宝'},
__fields = {
	'Id',
	'Name',
	'Location',
	'Level',
	'Race',
	'LevelupPool',
	'RankupPool',
	'Max',
	'RankupCount',
	'RankupResources'
},
__defaults = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
__refs = {
	{24,1.93},
	{1,.4,2.1,-1,4.1,8.7},
	{2,1.4,-4,2.1,4.1,8.7},
	{1,.9,2.1,4.1},
	{1.01,-9,1.9,2.1,2.1},
	{1,.4,2.1,4.1,8.1},
	{{{1},{10,4,2,1.2,-8,4.1,8.1,16.51}},{{2},{6,5,-2.2,1,-10,4.1,8.1,16.51}}},
	{4,.93},
	{{{1,1},{12,.93}},{{1,2},{19,1.4,-4,2.1,4.1,8.7}}}
},
__refPoss = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
}
return JewelConfig