local MainMapIconConfig = {
__count = 12,
__indexs = {1.3,3,1.2,2,1,2,4.2},
__values = {0,1,-2.3,8,5,-10.3,250,200,300,200,-500.2,-1000.4},
__exVals = {5,'0','有变强的方法吗#您收徒吗？我要拜师！#怎么提升战力呢？','呀！发财了！#嘿嘿！这次赚大了！#亮晶晶的钱币真有爱！#钱币叮当作响格外悦耳！#捡到小钱钱咯！#一笔天降之财！#万水千山只等钱！#最喜欢捡钱啦！#一会去买点什么呢？#缺什么也不能缺钱！','啧！好东西不少嘛！#哈哈！捡到宝了！#今天运气真不错！#兵器铠甲！我的最爱！#真是鸿运当头啊！#得来全不费工夫！#今天时来运转咯！#收获不菲！#战力又能提升一些了！','勤于修炼，多多益善#你我缘分未到#获得更多的神将并增加历练'},
__fields = {
	'Icon',
	'Desc',
	'DescNPC',
	'HurtMin',
	'HurtMax',
	'HurtNum',
	'StrikeProbability',
	'Steps'
},
__defaults = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
__refs = {
	{21,.3,1.2,-2,3,-3,.3},
	{21,.3,4,-4,.6},
	{11,2,3,-4,-11,0,16,-16,14,-14,0,15},
	{13,2,5,-6,-13,0,18,-18,16,-16,0,17},
	{2,1,-2,2,-2,0,4,-4,3,-3,0,3},
	{7,1,-7,7,-7,0,9,-9,8,-8,0,8},
	{1,.8,5,0,-5}
},
__refPoss = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
}
return MainMapIconConfig