local SevenDaysScore = {
__count = 200,
__indexs = {1.002},
__values = {1.001,11913},
__exVals = {100,'积分达到1分','积分达到2分','积分达到3分','积分达到4分','积分达到5分','积分达到6分','积分达到7分','积分达到8分','积分达到9分','积分达到10分','积分达到11分','积分达到12分','积分达到13分','积分达到14分','积分达到15分','积分达到16分','积分达到17分','积分达到18分','积分达到19分','积分达到20分','积分达到21分','积分达到22分','积分达到23分','积分达到24分','积分达到25分','积分达到26分','积分达到27分','积分达到28分','积分达到29分','积分达到30分','积分达到31分','积分达到32分','积分达到33分','积分达到34分','积分达到35分','积分达到36分','积分达到37分','积分达到38分','积分达到39分','积分达到40分','积分达到41分','积分达到42分','积分达到43分','积分达到44分','积分达到45分','积分达到46分','积分达到47分','积分达到48分','积分达到49分','积分达到50分','积分达到51分','积分达到52分','积分达到53分','积分达到54分','积分达到55分','积分达到56分','积分达到57分','积分达到58分','积分达到59分','积分达到60分','积分达到61分','积分达到62分','积分达到63分','积分达到64分','积分达到65分','积分达到66分','积分达到67分','积分达到68分','积分达到69分','积分达到70分','积分达到71分','积分达到72分','积分达到73分','积分达到74分','积分达到75分','积分达到76分','积分达到77分','积分达到78分','积分达到79分','积分达到80分','积分达到81分','积分达到82分','积分达到83分','积分达到84分','积分达到85分','积分达到86分','积分达到87分','积分达到88分','积分达到89分','积分达到90分','积分达到91分','积分达到92分','积分达到93分','积分达到94分','积分达到95分','积分达到96分','积分达到97分','积分达到98分','积分达到99分','积分达到100分'},
__fields = {
	'Id',
	'ActivityId',
	'Show',
	'TaskValue',
	'Reward'
},
__defaults = {
	nil,
	nil,
	nil,
	nil
},
__refs = {
	{10,.99,15,.99},
	{102,1.99,-99,1.99},
	{1.001,-99,1.99},
	{{{1,1},{101,.991}},{{1,2},{1.001,-99,1.99}}}
},
__refPoss = {
	nil,
	nil,
	nil,
	nil
},
}
return SevenDaysScore