local WorkShopEquipmentConfig = {
__count = 84,
__indexs = {9202,1.11,50788,1.17},
__values = {0,1.5,25,5,15,958,1,1992,1.71,5,2.1,1.8,3,1.8,5937,1.3},
__exVals = {74,null,'真香！','猎户大斧','兽骨大斧','坚固大斧','猎户短剑','兽骨短剑','坚固短剑','猎户法杖','兽骨法杖','坚固法杖','猎户战刀','兽骨战刀','坚固战刀','猎户铜铃','兽骨铜铃','坚固铜铃','戍卫战甲','硬木战甲','黑铁战甲','兽皮软甲','坚固皮甲','游侠软甲','猎户草帽','兽皮兜帽','坚固头盔','猎户草鞋','兽皮皮靴','坚固布鞋','猎户指环','兽皮指环','坚固手套','猎户皮带','兽皮束带','坚固腰带','乌木大斧','陨铁大斧','寒铜大斧','乌木短剑','陨铁短剑','寒铜短剑','乌木法杖','陨铁法杖','寒铜法杖','光羽长剑','破空长剑','逐光长剑','乌木法铃','陨铁法铃','寒铜法铃','乌木战甲','陨铁战甲','寒铜战甲','墨玉战甲','飞羽战甲','青烟战甲','乌木战盔','陨铁战盔','寒铜战盔','乌木战靴','陨铁战靴','寒铜战靴','乌木戒指','陨铁戒指','寒铜戒指','乌木腰带','陨铁腰带','寒铜腰带','御风战斧','困雨战斧','折雪战斧','御风短剑','困雨短剑','折雪短剑'},
__fields = {
	'Id',
	'ShortDesc',
	'Type',
	'OpenRules',
	'Sort',
	'FunctionStyle',
	'Mineral',
	'RunesNum',
	'SpecialRunes',
	'Exp'
},
__defaults = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
__refs = {
	{71,.11,1.27},
	{3,.11,-1,.17},
	{{{1},{4,.11,-2,.71,1,.35}},{{2},{1,.11,6,.4,1,.3,1,.8,39,1.71,-53,1.53}}},
	{2,1.2,.2,1,0,-3,0,1.3,.9,1,.8,-1,.8,4.3,.71,1,.71},
	{4,.11,-2,.4,1,.3,-1,4.1,8.1,.9,1,.7,4.1},
	{{{1},{66,1.2,.2,1,0,-3,0,1.3,-59,.8,1,.8,-1,4.1,.71,1,.71}},{{2},{2,.38}}},
	{3,.38},
	{{{1,1},{70,.38}}},
	{1,.38}
},
__refPoss = {
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil,
	nil
},
}
return WorkShopEquipmentConfig